Autodesk.Revit.DB.Connector.GetMEPConnectorInfo
Gets MEP connector information.
Returns:
Returns null if there is no MEP connector information associated.
Since:
2016

Autodesk.Revit.DB.Connector.GetFabricationConnectorInfo
Gets fabrication connectivity information.
Returns:
Returns null if there is no fabrication connector information associated.
Since:
2016

Autodesk.Revit.DB.Connector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Connector.Id
A unique identifier to identify this connector.
Since:
2016

Autodesk.Revit.DB.Connector.Description
The description.
Since:
2015

Autodesk.Revit.DB.Connector.Utility
Indicates if the connector is a utility connector.
Since:
2015

Autodesk.Revit.DB.Connector.AllowsSlopeAdjustments
Indicates if the connector allows the slope adjustment.
Since:
2015

Autodesk.Revit.DB.Connector.EngagementLength
Connector engagement length

Autodesk.Revit.DB.Connector.IsConnectedTo(Autodesk.Revit.DB.Connector)
Identifies if the connector is connected to the specified connector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.

Autodesk.Revit.DB.Connector.DisconnectFrom(Autodesk.Revit.DB.Connector)
Remove connection between two connectors.
connector: Indicate the connector, connection will be removed from.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when no connection between these two connector.
Thrown on failure to remove the connection between these two connectors.

Autodesk.Revit.DB.Connector.ConnectTo(Autodesk.Revit.DB.Connector)
Make connection between two connectors.
connector: Indicate the connector will be connected to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when two connectors with different domain types.
Thrown when these two connectors fail to connect each other.
Thrown when connection already exists.
Remarks: Connection success may create a new Fitting between two connectors, if necessary.

Autodesk.Revit.DB.Connector.IsMovable
whether the connector can be moved.
Remarks: Only connectors of type EndConn can be moved.

Autodesk.Revit.DB.Connector.Angle
The angle of the Connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac, DomainPiping, or DomainCableTrayConduit.
Thrown when set value for the connector not in family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when setting an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to set angle.
Remarks: Angle may be assigned for connectors of some family instances.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.
For a connector obtained from a non-family instance (for example not a fitting, but instead a pipe, duct, or
cable tray), the value will always be zero. Non-zero angles are only valid for family instance fitting connectors.

Autodesk.Revit.DB.Connector.AssignedKCoefficient
The assigned kCoefficient of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set kCoefficient.
Remarks: Assigned kCoefficient may be assigned for connectors of some family instances, for more information.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.AssignedFixtureUnits
The assigned fixture units of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set assigned fixture units.
Remarks: Assigned fixture units may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.AssignedFlow
The assigned flow of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping or DomainHvac.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set assigned flow.
Remarks: Assigned flow may be assigned for connectors of some family instances.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.AssignedPressureDrop
The assigned pressure drop of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector is not in a family instance.
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set assigned pressure drop.
Remarks: Assigned pressure drop may be assigned for connectors of some family instances.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.AssignedPipeLossMethod
The pipe loss method of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get pipe loss method.
Remarks: Assigned duct pipe loss method may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.AssignedDuctLossMethod
The duct loss method of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac.
Thrown when the connector is not in family instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get duct loss method.
Remarks: Assigned duct loss method may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.AssignedDuctFlowConfiguration
The assigned duct flow configuration of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get duct flow configuration.
Remarks: Assigned duct flow configuration may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.AssignedPipeFlowConfiguration
The pipe flow configuration type of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get pipe flow configuration.
Remarks: Assigned pipe flow configuration may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.AssignedLossCoefficient
The assigned loss coefficient of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac.
Thrown when the connector is not in a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set assigned loss coefficient.
Remarks: Assigned loss coefficient may be assigned for connectors of some family instances, for more information.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.AssignedFlowFactor
The assigned flow factor of this connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when get assigned flow factor from a connector not in family instance.
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throw when set an invalid value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get or set assigned flow factor.
Remarks: Assigned flow factor may be assigned for connectors of some family instances.
In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.IsConnected
Identifies if the connector is physically connected to a connector on another element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's type is LogicalConn.

Autodesk.Revit.DB.Connector.MEPSystem
The system of the connector belong to.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get system.

Autodesk.Revit.DB.Connector.PressureDrop
The pressure drop of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Remarks: Instantaneous pressure drop of this connector, calculated according to system.

Autodesk.Revit.DB.Connector.VelocityPressure
The velocity pressure of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Remarks: Instantaneous velocity pressure of this connector,calculated according to system.

Autodesk.Revit.DB.Connector.ConnectorManager
The connector manager of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get connector manager.

Autodesk.Revit.DB.Connector.Demand
The demand of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get demand.
Remarks: Instantaneous demand at this connector, calculated according to system.

Autodesk.Revit.DB.Connector.PipeSystemType
The pipe system type of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get pipe system type.
Remarks: Instantaneous system type at this connector, calculated according to system. For unconnected connectors,
system type is undefined.

Autodesk.Revit.DB.Connector.ElectricalSystemType
The electrical system type of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not of DomainElectrical.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get electrical system type.
Remarks: Instantaneous system type at this connector, calculated according to system. For unconnected connectors,
system type is undefined.

Autodesk.Revit.DB.Connector.DuctSystemType
The duct system type of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get duct system type.
Remarks: This is the instantaneous system type at this connector, calculated according to system. For unconnected connectors,
the system type is undefined.

Autodesk.Revit.DB.Connector.AssignedFlowDirection
The assigned flow direction of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector is not in a family instance.
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get assigned flow direction.
Remarks: Flow direction may be assigned for connectors of some family instances.

Autodesk.Revit.DB.Connector.Direction
The direction of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get direction.
Remarks: Instantaneous direction of this connector, calculated according to system.

Autodesk.Revit.DB.Connector.Coefficient
The coefficient of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainHvac or DomainPiping.
Remarks: Instantaneous coefficient of this connector, calculated according to system.

Autodesk.Revit.DB.Connector.Flow
The flow of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's domain is not DomainPiping or DomainHvac.
Remarks: Instantaneous flow at this connector, calculated according to system.

Autodesk.Revit.DB.Connector.Radius
The radius of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not round.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to set radius.
Remarks: In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.Height
The height of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not rectangular.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to set height.
Remarks: In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.Width
The width of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector's shape is not rectangular.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the argument is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to set width.
Remarks: In order to set this property, it must be mapped to a writable instance parameter in the family definition.

Autodesk.Revit.DB.Connector.Shape
The shape of the connector.

Autodesk.Revit.DB.Connector.ConnectorType
The connector type of the connector.

Autodesk.Revit.DB.Connector.AllRefs
All references of the connector.
Remarks: A set of connectors that the connectors is connected to, including both physical connection and logical connection.

Autodesk.Revit.DB.Connector.Domain
The domain of the connector.

Autodesk.Revit.DB.Connector.Owner
The host of the connector.
Remarks: The element that contains this connector. It may also contain other connectors.

Autodesk.Revit.DB.Connector.CoordinateSystem
The coordinate system of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the connector is of logical type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to get coordinate system.
Remarks: The coordinate system's origin is the location of the connector
and the Z-axis is normal to the connector.

Autodesk.Revit.DB.Connector.Origin
The location of the connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when connector's type is NonEndConn.
Thrown when the connector is a part of a family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the assigned origin is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown on failure to set origin.
Remarks: Changing the location of the connector may lead to changes of location
and geometry for the connector's host element and the hosts for other elements
the element is connected to.

Autodesk.Revit.DB.Connector
A connector in an Autodesk Revit MEP project document.
Remarks:
This connector is an item that is a part of another element (duct, pipe, fitting, or equipment etc.).
This connector does not represent the connector element that can be created inside a family;
for that element, refer to Autodesk.Revit.DB.ConnectorElement.